app/graphql/mutations/auth/login.rb

SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "irsath+7@commutatus.com"], ["LIMIT", 1]]
---
      def resolve(auth:)
        user = User.find_by(email: auth[:email])