app/graphql/mutations/auth/sign_up.rb

      def resolve(auth:)
        user = User.new auth.to_h
        user.save!
---
INSERT INTO "users" ("name", "email", "phone", "created_at", "updated_at", "encrypted_password") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"