app/graphql/mutations/posts/create.rb

      def resolve(args)
        context[:current_user].posts.create!(args.to_h)
---
INSERT INTO "posts" ("body", "post_type", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "Test"], ["post_type", 0], ["user_id", 4], ["created_at", "2021-01-07 02:34:44.929922"], ["updated_at", "2021-01-07 02:34:44.929922"]]