app/models/api_key.rb

SELECT "api_keys".* FROM "api_keys" WHERE (expires_at > '2021-01-07 02:34:44.712919') AND "api_keys"."access_token" = $1 LIMIT $2  [["access_token", "c22a237ad216289f075e070c2d0117c7"], ["LIMIT", 1]]
---
  def self.verify(access_token)
    api_key = self.active.find_by(access_token: access_token)

UPDATE "api_keys" SET "expires_at" = $1, "updated_at" = $2 WHERE "api_keys"."id" = $3  [["expires_at", "2021-01-07 02:06:36.048049"], ["updated_at", "2021-01-07 02:06:36.048613"], ["id", 1]]
---
  def expire
    self.update(expires_at: DateTime.now)