app/models/user.rb

  def generate_api_key
    api_keys.active.each { |api_key| api_key.expire }
    api_keys.create
---
INSERT INTO "api_keys" ("user_id", "access_token", "expires_at", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"